// •	Брой пилешки менюта – цяло число в интервала [0 … 99] - 2
// •	Брой менюта с риба – цяло число в интервала [0 … 99] - 4
// •	Брой вегетариански менюта – цяло число в интервала [0 … 99] - 3

// Ресторант отваря врати и предлага няколко менюта на преференциални цени: 
// •	Пилешко меню –  10.35 лв. 
// •	Меню с риба – 12.40 лв. 
// •	Вегетарианско меню  – 8.15 лв. 
// Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
// Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката). 
// Цената на доставка е 2.50 лв и се начислява най-накрая.  

// da se otpechatva: obshta cena 

function foodDelivery(input) {
    let chickenMenu = Number(input[0]);
    let fishMenu = Number(input[1]);
    let vegieMenu = Number(input[2]);

    let totalPriceMenu = chickenMenu * 10.35 + fishMenu * 12.40 + vegieMenu * 8.15;
    let dessert = totalPriceMenu * 0.20;

    let total = totalPriceMenu + dessert + 2.50;

    console.log(total);
}

foodDelivery(["9","2","6"]);